//#include <stdio.h>
//#include <stdlib.h>
//
//int main(void)
//{
//	//二位数组的定义与初始化
//
//	int arry_2d[2][3]={ {2,5,4},{6,9} };  //2行3列 对于未赋值的元素默认为0,可以使用断点调试看值
//										//调试时断点那行不运行！！！所以要设置断点在下一行！
//										//int arry[2][2]={1,2,3,4}  这样初始化也可以
//	printf("%d\n", sizeof(arry_2d) / sizeof(arry_2d[0][0])); //可以显示数组的个数
//	printf("%p,%p,%p,%p,%p,%p\n", &arry_2d[0][0], &arry_2d[0][1], &arry_2d[0][2], &arry_2d[1][0], &arry_2d[1][1], &arry_2d[1][2]);
//	printf("%p,%p\n", &arry_2d[0], &arry_2d[1]);  //&a[0]==&a[0][0],&a[1]==&a[1][0]
//	printf("%p\n", arry_2d);			// ！！单个a 表示数组a的首地址
//	printf("%p\n", &arry_2d);			//a 就相当于 &a  表示数组a的首地址
//
//	printf("%p,%p,%p", &arry_2d + 1, &arry_2d[0] + 1, &arry_2d[0][0] + 1);
//	//形象化描述 &a表示一个小区的地址 &a+1表示下一小区的地址；&a[0]表示小区第一栋楼的地址 &a[0]+1表示第二栋楼地址
//	//&a[0][0]表示第一栋楼第一户的地址 &a[0][0]+1表示第二户的住址。
//
//
//
//	return 0;
//}