//#include <stdio.h>
//#include <stdlib.h>
//
//int main(void)
//{
//	//指针数组 即指针的数组；本质是一个数组，但是数组里存的是指针
//	//数组的每个元素都是int *类型的
//
//	int b = 2,
//		c = 3,
//		d = 4,
//		e = 5;
//	int* a[4] = { &b,&c,&d,&e }; //数组a即指针数组。当然还有结构体数组，数组数组等
//	//不确定类型时可以根据编译器的提示修改类型
//
//	//a[2] == &d
//	*a[2] = 7; //对a[2]（d）的赋值 
//	printf("%d,%d\n", d,*a[2]);
//
//	//指针数组的应用--类似于哈希表的链地址法解决冲突（拉链结构）
//	int arr1[2] = { 5,7 };
//	int arr2[5] = { 1,8,77,25,6 };
//	int arr3[4] = { 6,3,84 };
//	int arr4[8] = { 99,82,42,36,75,92,15,41};
//	int* p[5] = { arr1,arr2,arr3,&arr4[0] };
//	printf("%d,%d\n", arr2[2], *(p[1] + 2));  //p[1]==arr2==&arr2[0]  p[1]+2==&arr2[2]
//	printf("%d,%d\n", arr1[0], p[0][0]);  //也是下标运算   相当于 地址+数；所以说二维数组a[][]是下标运算
//	//二维数组与拉链结构的不同：1.二维数组的地址是连续的，这不是连续的；2.二维数组每个数组大小要一致；3.拉链结构子数组的类型可以不相同
//
//	return 0;
//}